lessons/fubianhanshu/2.org
#+TITLE: 
#+AUTHOR: MKQ
#+KEYWORDS: note
#+LATEX_COMPILER: xelatex
#+LATEX_HEADER:\usepackage[scheme=plain]{ctex}
* 复数的极限还有无穷远点
- 定义:趋于某个值
\[ 
\lim \|z_n -z_0\| =0
\]
那么
\[
\lim \| x_n -x_0\| =0,\lim \| y_n -y_0\| =0
\]
也有
\[
\lim x_n=x_0,\lim x_n=y_0,\lim z_n=z_0
\]
- 定义:趋于无穷

for all M >0 ,exist N ,so that n>N \|z_n\| > M
那么
\[
\lim z_n =\infty
\]
** 复数球面
复平面上顶个球S点在复平面原点上,球的N极向平面上一个点连线,与球面相交于点,这么两个点之间最短弧长
就是这两个复数之间的弦距,这个点叫做复数的球体投影,
这相当于定义了一个球面上点到平面上点的映射,但是北极点没有呀,这可怎么办,
北极点其实对应的是无穷远点\infty
- 球极映射定义了一个
\[
\bar{C}=C \cup {\infty}
\]
- 无穷远点的实部虚部都是没有意义的,但是模长还是有意义的
\[
\|\infty\|= + \infty
\]
- 
\[
a \neq 0, a\finty = \finty,\frac{a}{0}=\infty
\]
- 
\[
a \neq \infty ,a\pm \infty= \infty,\frac{a}{\infty}=0,\frac{\infty}{a}=0
\]
* 平面点集
** 点分类
\[\{z | \|z-z_0 \| <\rho \}\]
是z的 \rho 邻域,考虑平面内一点集合
- 内点:如果存在一个 \rho > 0 使得 z_0 的\rho邻域包含于 E ,那么z是E的内点
- 外点:.....................................全部在E之外,那么z是E的外点
- 边界点:不是内点也不是外点
** 点集分类
- 开集:所有的点都是内点
- 边界:\partial E 所有边界点的集合
- 闭集:\partial E \in E
- 有界集
- 无界集
* 区域
** 区域D:
- 必须是开集
- 必须是连通集,任何两点都可以通过一条线连起来
- \bar{D} = \{D \cup \partial D\}是闭区域
** 曲线
\begin{cases}
x=x(t)  \\
y=y(t)
\end{cases}
z(t)=x(t)+iy(t)
- 若当曲线
- 若当闭曲线:将平面分成一个有界区域一个无界区域
** 联通集
- 单联通:没有洞
- 多联通:有洞,洞可以是一个点


* 复变量函数 
- 定义:E是复平面内的点集 z \in E \rightarrow z \in C
所以E上定义了一个复单值函数
\[
w=f(z),z \in E
\]
(如果有多个w与之对应,那么f是多值函数,比如说开n次方,或者
\Arg z)
- 如果没有特别声明,主要考虑单值函数
- 
\[
w_0 = f(z_0)
\]
那么,w_0 是z_0 的像,z_0 是w_0 的原像
** 一一对应
w=f(z)是个单值函数,如果z_1,z_2 \in E,z_1 \neq z_2
 导致w_1 \neq w_2 ,那么就说f是E中的一一映射


** 例子
求下列点集在w=z^2 下的像
- 平行于坐标轴的直线
- 双曲线族
- 半圆环域
