lessons/fubianhanshu/2.tex
% Created 2019-09-05 四 10:48
% Intended LaTeX compiler: xelatex
\documentclass[11pt]{article}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage[scheme=plain]{ctex}
\author{MKQ}
\date{\today}
\title{}
\hypersetup{
 pdfauthor={MKQ},
 pdftitle={},
 pdfkeywords={note},
 pdfsubject={},
 pdfcreator={Emacs 24.5.1 (Org mode 9.0.3)}, 
 pdflang={English}}
\begin{document}

\tableofcontents

\section{复数的极限还有无穷远点}
\label{sec:org4923f7e}
\begin{itemize}
\item 定义:趋于某个值
\end{itemize}
\[ 
\lim \|z_n -z_0\| =0
\]
那么
\[
\lim \| x_n -x_0\| =0,\lim \| y_n -y_0\| =0
\]
也有
\[
\lim x_n=x_0,\lim x_n=y_0,\lim z_n=z_0
\]
\begin{itemize}
\item 定义:趋于无穷
\end{itemize}

for all M >0 ,exist N ,so that n>N $\backslash$|z\(_{\text{n}}\)$\backslash$| > M
那么
\[
\lim z_n =\infty
\]
\subsection{复数球面}
\label{sec:org13fd411}
复平面上顶个球S点在复平面原点上,球的N极向平面上一个点连线,与球面相交于点,这么两个点之间最短弧长
就是这两个复数之间的弦距,这个点叫做复数的球体投影,
这相当于定义了一个球面上点到平面上点的映射,但是北极点没有呀,这可怎么办,
北极点其实对应的是无穷远点\(\infty\)
\begin{itemize}
\item 球极映射定义了一个
\end{itemize}
\[
\bar{C}=C \cup {\infty}
\]
\begin{itemize}
\item 无穷远点的实部虚部都是没有意义的,但是模长还是有意义的
\end{itemize}
\[
\|\infty\|= + \infty
\]
\begin{itemize}
\item 
\end{itemize}
\[
a \neq 0, a\finty = \finty,\frac{a}{0}=\infty
\]
\begin{itemize}
\item 
\end{itemize}
\[
a \neq \infty ,a\pm \infty= \infty,\frac{a}{\infty}=0,\frac{\infty}{a}=0
\]
\section{平面点集}
\label{sec:orga41317d}
\subsection{点分类}
\label{sec:orgb7ce873}
\[\{z | \|z-z_0 \| <\rho \}\]
是z的 \(\rho\) 邻域,考虑平面内一点集合
\begin{itemize}
\item 内点:如果存在一个 \(\rho\) > 0 使得 z\(_{\text{0}}\) 的\rho邻域包含于 E ,那么z是E的内点
\item 外点:\ldots{}\ldots{}\ldots{}\ldots{}\ldots{}\ldots{}\ldots{}\ldots{}\ldots{}\ldots{}\ldots{}\ldots{}.全部在E之外,那么z是E的外点
\item 边界点:不是内点也不是外点
\end{itemize}
\subsection{点集分类}
\label{sec:org3f7d060}
\begin{itemize}
\item 开集:所有的点都是内点
\item 边界:\(\partial\) E 所有边界点的集合
\item 闭集:\(\partial\) E \(\in\) E
\item 有界集
\item 无界集
\end{itemize}
\section{区域}
\label{sec:orgb9b28d5}
\subsection{区域D:}
\label{sec:org5a4235f}
\begin{itemize}
\item 必须是开集
\item 必须是连通集,任何两点都可以通过一条线连起来
\item \bar{D} = $\backslash${D \(\cup\) \(\partial\) D$\backslash$}是闭区域
\end{itemize}
\subsection{曲线}
\label{sec:orgf23ebe1}
\begin{cases}
x=x(t)  \\
y=y(t)
\end{cases}
z(t)=x(t)+iy(t)
\begin{itemize}
\item 若当曲线
\item 若当闭曲线:将平面分成一个有界区域一个无界区域
\end{itemize}
\subsection{联通集}
\label{sec:orgac0305a}
\begin{itemize}
\item 单联通:没有洞
\item 多联通:有洞,洞可以是一个点
\end{itemize}


\section{复变量函数}
\label{sec:orgfc3bd50}
\begin{itemize}
\item 定义:E是复平面内的点集 z \(\in\) E \(\rightarrow\) z \(\in\) C
\end{itemize}
所以E上定义了一个复单值函数
\[
w=f(z),z \in E
\]
(如果有多个w与之对应,那么f是多值函数,比如说开n次方,或者
\Arg z)
\begin{itemize}
\item 如果没有特别声明,主要考虑单值函数
\item 
\end{itemize}
\[
w_0= f(z_0)
\]
那么,w\(_{\text{0是z}}\)\(_{\text{0的像,z}}\)\(_{\text{0是w}}\)\(_{\text{0的原像}}\)
\subsection{一一对应}
\label{sec:orgd5423e4}
w=f(z)是个单值函数,如果z\(_{\text{1,z}}\)\(_{\text{2}}\) \(\in\) E,z\(_{\text{1}}\) \(\neq\) z\(_{\text{2}}\)
导致w\(_{\text{1}}\) \(\neq\) w\(_{\text{2,那么就说f是E中的一一映射}}\)
\end{document}
